#------------------------------------------------------------------------------#
            lw 0 4 zero     #f[0] = 0                              #ex. input = 5 = fibo(5)
            lw 0 6 one      #f[1] = 1
            lw 0 2 one      #use to add start
            lw 0 1 input
            lw 0 5 start    #counter
#------------------------------------------------------------------------------#
            beq 4 1 f0      #if(input == 0) go to f0
            beq 6 1 f1      #if(input == 1) go to f1
#------------------------------------------------------------------------------#
    loop    add 4 6 4       #f[0] += f[1]      #start reg4=1       # reg4=3 
            add 5 2 5       #counter++                             # position =4                          
            beq 5 1 f0      #if(input == counter) go to f0         # if(input == position ) เอา reg4 ไปตอบ  
                                               #first value reg6=1
            add 6 4 6       #f[1] += f[0]                          # reg6=5 
            add 5 2 5       #counter++                             # start =5  
            beq 5 1 f1      #if(input == counter) go to f1         # if(input == position ) เอา reg6 ไปตอบ

            beq 0 0 loop    #go to loop                            
#------------------------------------------------------------------------------#
    f0      add 3 4 3       #reg3=reg4
            halt
    f1      add 3 6 3       #reg3=reg6
            halt
#------------------------------------------------------------------------------#
            zero .fill 0
            one .fill 1
            input .fill 6
            start .fill 1
#------------------------------------------------------------------------------#

            #    f(0) = 0
            #    f(1) = 1
            #    f(2) = f(1) + f(0) = 1 + 0 = 1
            #    f(3) = f(2) + f(1) = 1 + 1 = 2
            #    f(4) = f(3) + f(2) = 2 + 1 = 3
            #    f(5) = f(4) + f(3) = 3 + 2 = 5
            #    f(6) = f(5) + f(4) = 5 + 3 = 8

#------------------------------------------------------------------------------#
